DawningW/Microcontroller-Projects/stm32f407-ucos3/UCOS/OS3/Ports/ARM-Cortex-M/ARMv7-M/os_cpu_c.c
/*
*********************************************************************************************************
*                                         STATISTIC TASK HOOK
*
* Description: This function is called every second by uC/OS-III's statistics task.  This allows your
*              application to add functionality to the statistics task.
*
* Arguments  : None.
*
* Note(s)    : None.
*********************************************************************************************************
*/

void  OSStatTaskHook (void)
{
#if OS_CFG_APP_HOOKS_EN > 0u
    if (OS_AppStatTaskHookPtr != (OS_APP_HOOK_VOID)0) {
        (*OS_AppStatTaskHookPtr)();
    }
#endif
}


/*
*********************************************************************************************************
*                                          TASK CREATION HOOK
*
* Description: This function is called when a task is created.
*
* Arguments  : p_tcb        Pointer to the task control block of the task being created.
*
* Note(s)    : None.
*********************************************************************************************************
*/

void  OSTaskCreateHook (OS_TCB  *p_tcb)
{
#if OS_CFG_APP_HOOKS_EN > 0u
    if (OS_AppTaskCreateHookPtr != (OS_APP_HOOK_TCB)0) {
        (*OS_AppTaskCreateHookPtr)(p_tcb);
    }
#else
    (void)p_tcb;                                                /* Prevent compiler warning                             */
#endif
}


/*
*********************************************************************************************************
*                                           TASK DELETION HOOK
*
* Description: This function is called when a task is deleted.
*
* Arguments  : p_tcb        Pointer to the task control block of the task being deleted.
*
* Note(s)    : None.
*********************************************************************************************************
*/

void  OSTaskDelHook (OS_TCB  *p_tcb)
{
#if OS_CFG_APP_HOOKS_EN > 0u
    if (OS_AppTaskDelHookPtr != (OS_APP_HOOK_TCB)0) {
        (*OS_AppTaskDelHookPtr)(p_tcb);
    }
#else
    (void)p_tcb;                                                /* Prevent compiler warning                             */
#endif
}


/*
*********************************************************************************************************
*                                            TASK RETURN HOOK
*
* Description: This function is called if a task accidentally returns.  In other words, a task should
*              either be an infinite loop or delete itself when done.
*
* Arguments  : p_tcb        Pointer to the task control block of the task that is returning.
*
* Note(s)    : None.
*********************************************************************************************************
*/

void  OSTaskReturnHook (OS_TCB  *p_tcb)
{
#if OS_CFG_APP_HOOKS_EN > 0u
    if (OS_AppTaskReturnHookPtr != (OS_APP_HOOK_TCB)0) {
        (*OS_AppTaskReturnHookPtr)(p_tcb);
    }
#else
    (void)p_tcb;                                                /* Prevent compiler warning                             */
#endif
}


/*
*********************************************************************************************************
*                                        INITIALIZE A TASK'S STACK
*
* Description: This function is called by either OSTaskCreate() or OSTaskCreateExt() to initialize the
*              stack frame of the task being created.  This function is highly processor specific.
*
* Arguments  : p_task       Pointer to the task entry point address.
*
*              p_arg        Pointer to a user supplied data area that will be passed to the task
*                               when the task first executes.
*
*              p_stk_base   Pointer to the base address of the stack.
*
*              stk_size     Size of the stack, in number of CPU_STK elements.
*
*              opt          Options used to alter the behavior of OS_Task_StkInit().
*                            (see OS.H for OS_TASK_OPT_xxx).
*
* Returns    : Always returns the location of the new top-of-stack once the processor registers have
*              been placed on the stack in the proper order.
*
* Note(s)    : (1) Interrupts are enabled when task starts executing.
*
*              (2) All tasks run in Thread mode, using process stack.
*
*              (3) There are two different stack frames depending on whether the Floating-Point(FP)
*                  co-processor is enabled or not.
*
*                  (a) The stack frame shown in the diagram is used when the Co-processor Access Control
*                      Register(CPACR) is disabling the Floating Point Unit. In this case, the FP
*                      registers(S0- S31) & FP Status Control(FPSCR) register are not saved in the stack frame.
*
*                  (b) The stack frame shown in the diagram is used when the Floating Point Unit is enabled,
*                      that is, CP10 and CP11 field in CPACR are ones and FPCCR sets bits ASPEN and LSPEN to 1.
*
*                      (1) When enabling the FPU through CPACR, make sure to set bits ASPEN and LSPEN in the
*                          Floating-Point Context Control Register (FPCCR).
*
*                                          +-------------+
*                                          |             |
*                                          +-------------+
*                                          |             |
*                                          +-------------+
*                                          |    FPSCR    |
*                                          +-------------+
*                                          |     S15     |
*                                          +-------------+
*                                          |     S14     |
*                                          +-------------+
*                                          |     S13     |
*                                          +-------------+
*                                                .
*                                                .
*                                                .
*                                          +-------------+
*                                          |     S2      |
*                                          +-------------+
*                                          |     S1      |
*                    +-------------+       +-------------+
*                    |             |       |     S0      |
*                    +-------------+       +-------------+
*                    |    xPSR     |       |    xPSR     |
*                    +-------------+       +-------------+
*                    | Return Addr |       | Return Addr |
*                    +-------------+       +-------------+
*                    |  LR(R14)    |       |   LR(R14)   |
*                    +-------------+       +-------------+
*                    |    R12      |       |     R12     |
*                    +-------------+       +-------------+
*                    |    R3       |       |     R3      |
*                    +-------------+       +-------------+
*                    |    R2       |       |     R0      |
*                    +-------------+       +-------------+
*                    |    R1       |       |     R1      |
*                    +-------------+       +-------------+
*                    |    R0       |       |     R0      |
*                    +-------------+       +-------------+
*                    | EXEC_RETURN |       | EXEC_RETURN |
*                    +-------------+       +-------------+
*                    |    R11      |       |     R11     |
*                    +-------------+       +-------------+
*                    |    R10      |       |     R10     |
*                    +-------------+       +-------------+
*                    |    R9       |       |     R9      |
*                    +-------------+       +-------------+
*                    |    R8       |       |     R8      |
*                    +-------------+       +-------------+
*                    |    R7       |       |     R7      |
*                    +-------------+       +-------------+
*                    |    R6       |       |     R6      |
*                    +-------------+       +-------------+
*                    |    R5       |       |     R5      |
*                    +-------------+       +-------------+
*                    |    R4       |       |     R4      |
*                    +-------------+       +-------------+
*                          (a)             |     S31     |
*                                          +-------------+
*                                          |     S30     |
*                                          +-------------+
*                                          |     S29     |
                                           +-------------+
*                                                .
*                                                .
*                                                .
*                                          +-------------+
*                                          |     S17     |
                                           +-------------+
*                                          |     S16     |
*                                          +-------------+
*                                               (b)
*
*             (4) The SP must be 8-byte aligned in conforming to the Procedure Call Standard for the ARM architecture
*
*                    (a) Section 2.1 of the  ABI for the ARM Architecture Advisory Note. SP must be 8-byte aligned
*                        on entry to AAPCS-Conforming functions states :
*
*                        The Procedure Call Standard for the ARM Architecture [AAPCS] requires primitive
*                        data types to be naturally aligned according to their sizes (for size = 1, 2, 4, 8 bytes).
*                        Doing otherwise creates more problems than it solves.
*
*                        In return for preserving the natural alignment of data, conforming code is permitted
*                        to rely on that alignment. To support aligning data allocated on the stack, the stack
*                        pointer (SP) is required to be 8-byte aligned on entry to a conforming function. In
*                        practice this requirement is met if:
*
*                           (1) At each call site, the current size of the calling function's stack frame is a multiple of 8 bytes.
*                               This places an obligation on compilers and assembly language programmers.
*
*                           (2) SP is a multiple of 8 when control first enters a program.
*                               This places an obligation on authors of low level OS, RTOS, and runtime library
*                               code to align SP at all points at which control first enters
*                               a body of (AAPCS-conforming) code.
*
*                       In turn, this requires the value of SP to be aligned to 0 modulo 8:
*
*                           (3) By exception handlers, before calling AAPCS-conforming code.
*
*                           (4) By OS/RTOS/run-time system code, before giving control to an application.
*
*                 (b) Section 2.3.1 corrective steps from the the SP must be 8-byte aligned on entry
*                     to AAPCS-conforming functions advisory note also states.
*
*                     " This requirement extends to operating systems and run-time code for all architecture versions
*                       prior to ARMV7 and to the A, R and M architecture profiles thereafter. Special considerations
*                       associated with ARMV7M are discussed in section 2.3.3"
*
*                     (1) Even if the SP 8-byte aligment is not a requirement for the ARMv7M profile, the stack is aligned
*                         to 8-byte boundaries to support legacy execution enviroments.
*
*                 (c) Section 5.2.1.2 from the Procedure Call Standard for the ARM
*                     architecture states :  "The stack must also conform to the following
*                     constraint at a public interface:
*
*                     (1) SP mod 8 = 0. The stack must be double-word aligned"
*
*                 (d) From the ARM Technical Support Knowledge Base. 8 Byte stack aligment.
*
*                     "8 byte stack alignment is a requirement of the ARM Architecture Procedure
*                      Call Standard [AAPCS]. This specifies that functions must maintain an 8 byte
*                      aligned stack address (e.g. 0x00, 0x08, 0x10, 0x18, 0x20) on all external
*                      interfaces. In practice this requirement is met if:
*
*                      (1) At each external interface, the current stack pointer
*                          is a multiple of 8 bytes.
*
*                      (2) Your OS maintains 8 byte stack alignment on its external interfaces
*                          e.g. on task switches"
*
*              (5) Exception Return Behavior(EXEC_RETURN)
*                  0xFFFFFFFD      Return to Thread mode, exception return uses non-floating point state
*                                  from the PSP and execution uses PSP after return.
*
*                  0xFFFFFFED      Return to Thread mode, exception return uses floating point state
*                                  from the PSP and execution uses PSP after return.
**********************************************************************************************************
*/

