DawningW/Microcontroller-Projects/stm32f407-ucos3/UCOS/OS3/Ports/ARM-Cortex-M/ARMv7-M/os_cpu_c.c
CPU_STK  *OSTaskStkInit (OS_TASK_PTR    p_task,
                         void          *p_arg,
                         CPU_STK       *p_stk_base,
                         CPU_STK       *p_stk_limit,
                         CPU_STK_SIZE   stk_size,
                         OS_OPT         opt)
{
    CPU_STK    *p_stk;


    (void)opt;                                                  /* 'opt' is not used, prevent warning                   */

    p_stk = &p_stk_base[stk_size];                              /* Load stack pointer                                   */
                                                                /* Align the stack to 8-bytes.                          */
    p_stk = (CPU_STK *)((CPU_STK)(p_stk) & 0xFFFFFFF8u);
                                                                /* Registers stacked as if auto-saved on exception      */
    *(--p_stk) = (CPU_STK)0x01000000u;                          /* xPSR                                                 */
    *(--p_stk) = (CPU_STK)p_task;                               /* Entry Point                                          */
    *(--p_stk) = (CPU_STK)OS_TaskReturn;                        /* R14 (LR)                                             */
    *(--p_stk) = (CPU_STK)0x12121212u;                          /* R12                                                  */
    *(--p_stk) = (CPU_STK)0x03030303u;                          /* R3                                                   */
    *(--p_stk) = (CPU_STK)0x02020202u;                          /* R2                                                   */
    *(--p_stk) = (CPU_STK)p_stk_limit;                          /* R1                                                   */
    *(--p_stk) = (CPU_STK)p_arg;                                /* R0 : argument                                        */
    *(--p_stk) = (CPU_STK)0xFFFFFFFDuL;                         /* R14: EXEC_RETURN; See Note 5                         */
                                                                /* Remaining registers saved on process stack           */
#if (__FPU_PRESENT == 1) && (__FPU_USED == 1)
    *(--p_stk) = (CPU_STK)0x31313131u;                          /* S31                                                  */
    *(--p_stk) = (CPU_STK)0x30303030u;                          /* S30                                                  */
    *(--p_stk) = (CPU_STK)0x29292929u;                          /* S29                                                  */
    *(--p_stk) = (CPU_STK)0x28282828u;                          /* S28                                                  */
    *(--p_stk) = (CPU_STK)0x27272727u;                          /* S27                                                  */
    *(--p_stk) = (CPU_STK)0x26262626u;                          /* S26                                                  */
    *(--p_stk) = (CPU_STK)0x25252525u;                          /* S25                                                  */
    *(--p_stk) = (CPU_STK)0x24242424u;                          /* S24                                                  */
    *(--p_stk) = (CPU_STK)0x23232323u;                          /* S23                                                  */
    *(--p_stk) = (CPU_STK)0x22222222u;                          /* S22                                                  */
    *(--p_stk) = (CPU_STK)0x21212121u;                          /* S21                                                  */
    *(--p_stk) = (CPU_STK)0x20202020u;                          /* S20                                                  */
    *(--p_stk) = (CPU_STK)0x19191919u;                          /* S19                                                  */
    *(--p_stk) = (CPU_STK)0x18181818u;                          /* S18                                                  */
    *(--p_stk) = (CPU_STK)0x17171717u;                          /* S17                                                  */
    *(--p_stk) = (CPU_STK)0x16161616u;                          /* S16                                                  */
#endif
    *(--p_stk) = (CPU_STK)0x11111111uL;                         /* R11                                                  */
    *(--p_stk) = (CPU_STK)0x10101010uL;                         /* R10                                                  */
    *(--p_stk) = (CPU_STK)0x09090909uL;                         /* R9                                                   */
    *(--p_stk) = (CPU_STK)0x08080808uL;                         /* R8                                                   */
    *(--p_stk) = (CPU_STK)0x07070707uL;                         /* R7                                                   */
    *(--p_stk) = (CPU_STK)0x06060606uL;                         /* R6                                                   */
    *(--p_stk) = (CPU_STK)0x05050505uL;                         /* R5                                                   */
    *(--p_stk) = (CPU_STK)0x04040404uL;                         /* R4                                                   */

    return (p_stk);
}


/*
*********************************************************************************************************
*                                           TASK SWITCH HOOK
*
* Description: This function is called when a task switch is performed.  This allows you to perform other
*              operations during a context switch.
*
* Arguments  : None.
*
* Note(s)    : 1) Interrupts are disabled during this call.
*              2) It is assumed that the global pointer 'OSTCBHighRdyPtr' points to the TCB of the task
*                 that will be 'switched in' (i.e. the highest priority task) and, 'OSTCBCurPtr' points
*                 to the task being switched out (i.e. the preempted task).
*********************************************************************************************************
*/

void  OSTaskSwHook (void)
{
#if OS_CFG_TASK_PROFILE_EN > 0u
    CPU_TS  ts;
#endif
#ifdef  CPU_CFG_INT_DIS_MEAS_EN
    CPU_TS  int_dis_time;
#endif
#if (OS_CFG_TASK_STK_REDZONE_EN > 0u)
    CPU_BOOLEAN  stk_status;
#endif

#if OS_CFG_APP_HOOKS_EN > 0u
    if (OS_AppTaskSwHookPtr != (OS_APP_HOOK_VOID)0) {
        (*OS_AppTaskSwHookPtr)();
    }
#endif

    OS_TRACE_TASK_SWITCHED_IN(OSTCBHighRdyPtr);

